# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"

# Brews
brew "jpeg-xl"
brew "aom"
brew "autoconf"
brew "automake"
brew "bat"
brew "icu4c"
brew "boost"
brew "cc65"
brew "ccls"
brew "cmake"
brew "fd"
brew "unbound"
brew "harfbuzz"
brew "tesseract"
brew "ffmpeg"
brew "glfw"
brew "ncurses"
brew "htop"
brew "lf"
brew "libtool"
brew "mpc"
brew "mpd", restart_service: true
brew "mpdscribble", restart_service: true
brew "ncmpcpp"
brew "neovim"
brew "newsboat"
brew "node"
brew "pkg-config"
brew "ripgrep"
brew "tmux"
brew "youtube-dl"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "mas"

# Casks
cask "alacritty"
cask "alfred"
cask "font-fantasque-sans-mono"
cask "google-chrome"
cask "stats"
cask "karabiner-elements"
cask "itsycal"

# AppStore
mas "PopClip", id: 445189367
mas "Hidden Bar", id: 1452453066 
mas "Wipr", id: 1320666476
mas "Vimari ", id: 1480933944
